**LABORATORIUM 2**<br>
Martyna Wolny

In [2]:
import psycopg2 as pg
import pandas as pd

In [3]:
# fragment kodu dodany tylko aby zapobiec wyskakiwaniu ostrzeżenia "please consider using sqlalchemy" przy każdym uzyciu psycopg2
import warnings

warnings.filterwarnings('ignore')

In [4]:
connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [5]:
df = pd.read_sql('select * from city',con=connection)
print(df)

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

**ZADANIE 1**

In [6]:
df = pd.read_sql('SELECT COUNT(category_id) FROM category',con=connection)
print(df)

   count
0     16

**ZADANIE 2**

In [7]:
df = pd.read_sql('SELECT name FROM category ORDER BY name ASC',con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

**ZADANIE 3**

In [8]:
df = pd.read_sql('SELECT title, release_year FROM film ORDER BY release_year ASC FETCH FIRST 1 ROW ONLY',con=connection)
print('Najmlodszy film:')
print(df)

Najmlodszy film:
             title  release_year
0  Chamber Italian          2006

In [9]:
df = pd.read_sql('SELECT title, release_year FROM film ORDER BY release_year DESC FETCH FIRST 1 ROW ONLY',con=connection)
print('Najstarszy film:')
print(df)

Najstarszy film:
             title  release_year
0  Chamber Italian          2006

In [10]:
df = pd.read_sql('SELECT title, release_year FROM film ORDER BY release_year ASC',con=connection)
print(df)
print('Wszystkie filmy wydane zostaly w tym samym roku (2006)')

                 title  release_year
0      Chamber Italian          2006
1     Grosse Wonderful          2006
2      Airport Pollock          2006
3    Bright Encounters          2006
4     Academy Dinosaur          2006
..                 ...           ...
995     Young Language          2006
996         Youth Kick          2006
997       Zhivago Core          2006
998  Zoolander Fiction          2006
999          Zorro Ark          2006

[1000 rows x 2 columns]
Wszystkie filmy wydane zostaly w tym samym roku (2006)

**ZADANIE 4**

In [11]:
df = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2005-07-01'::timestamp AND '2005-08-01'::timestamp",con=connection)
print(df)

   count
0   6709

**ZADANIE 5**

In [12]:
df = pd.read_sql("SELECT COUNT(rental_date) FROM rental WHERE rental_date BETWEEN '2010-01-01'::timestamp AND '2011-02-01'::timestamp",con=connection)
print(df)

   count
0      0

**ZADANIE 6**

In [13]:
df = pd.read_sql('SELECT amount FROM payment ORDER BY amount DESC FETCH FIRST 1 ROW ONLY',con=connection)
print(df)

   amount
0   11.99

**ZADANIE 7**

In [20]:
df = pd.read_sql("SELECT customer_id, first_name, last_name FROM customer WHERE address_id IN (SELECT address_id FROM address WHERE city_id IN (SELECT city_id FROM city WHERE country_id IN (SELECT country_id FROM country WHERE country IN ('Poland', 'Nigeria', 'Bangladesh'))))",con=connection)
print(df)

   customer_id first_name  last_name
0          270       Leah     Curtis
1          380    Russell    Brinson
2          128   Marjorie     Tucker
3          318      Brian      Wyman
4          572     Sidney   Burleson
5          501      Ruben      Geary
6          558     Jimmie  Eggleston
7          571    Johnnie   Chisholm

**ZADANIE 8**

In [15]:
df = pd.read_sql("SELECT address, district, city.city, country.country FROM address LEFT JOIN city ON address.city_id = city.city_id LEFT JOIN country ON country.country_id = city.country_id WHERE address_id IN (SELECT address_id FROM staff)", con=connection)
print(df)

                address district        city    country
0     23 Workhaven Lane  Alberta  Lethbridge     Canada
1  1411 Lillydale Drive      QLD   Woodridge  Australia

**ZADANIE 9**

In [16]:
df = pd.read_sql("SELECT COUNT (staff_id) FROM staff WHERE address_id IN (SELECT address_id FROM address WHERE city_id IN (SELECT city_id FROM city WHERE country_id IN (SELECT country_id FROM country WHERE country IN ('Argentina', 'Spain'))))",con=connection)
print('Liczba pracowników miszkających w Argentynie lub Hiszpanii:')
print(df)

Liczba pracowników miszkających w Argentynie lub Hiszpanii:
   count
0      0

**ZADANIE 10**

In [17]:
df = pd.read_sql("SELECT name FROM category WHERE category_id IN (SELECT category_id FROM film_category WHERE film_id IN (SELECT film_id FROM film WHERE film_id IN (SELECT film_id FROM inventory WHERE inventory_id IN (SELECT inventory_id FROM rental))))",con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

**ZADANIE 11**

In [18]:
df = pd.read_sql("SELECT name FROM category WHERE category_id IN (SELECT category_id FROM film_category WHERE film_id IN (SELECT film_id FROM film WHERE film_id IN (SELECT film_id FROM inventory WHERE inventory_id IN (SELECT inventory_id FROM rental WHERE customer_id IN (SELECT customer_id FROM customer WHERE address_id IN (SELECT address_id FROM address WHERE city_id IN (SELECT city_id FROM city WHERE country_id IN (SELECT country_id FROM country WHERE country IN ('United States')))))))))",con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

**ZADANIE 12**

In [19]:
df = pd.read_sql("SELECT title, film_actor.actor_id, actor.first_name, actor.last_name FROM film LEFT JOIN film_actor ON film.film_id = film_actor.film_id LEFT JOIN actor ON film_actor.actor_id = actor.actor_id WHERE actor.first_name IN ('Julia', 'Olympia', 'Ellen') AND actor.last_name IN ('Zellweger', 'Pfeiffer', 'Presley')",con=connection)
print(df)

                title  actor_id first_name  last_name
0     Bilko Anonymous        93      Ellen    Presley
1   Caribbean Liberty        93      Ellen    Presley
2    Casper Dragonfly        93      Ellen    Presley
3    Empire Malkovich        93      Ellen    Presley
4       Floats Garden        93      Ellen    Presley
..                ...       ...        ...        ...
64       Outlaw Hanky       186      Julia  Zellweger
65    Panky Submarine       186      Julia  Zellweger
66   Rider Caddyshack       186      Julia  Zellweger
67          Won Dares       186      Julia  Zellweger
68      Wyoming Storm       186      Julia  Zellweger

[69 rows x 4 columns]